# To change this template, choose Tools | Templates
# and open the template in the editor.

OrbadaWelcomePlugin-description-name=Wtyczka widoku powitalnego %s
WelcomeView-public-name=Widok powitalny
WelcomeView-description=Widok powitalny systemu ORBADA
settings-text=Ustawienia
cmDrivers-text=<html>Sterowniki<br>JDBC
cmNewConnection-text=<html>Schematy<br>po\u0142\u0105cze\u0144
cmSwitchShow-text=Nie pokazuj okna powitalnego przy ponownym uruchomieniu programu
WelcomeViewPanel-settings-apperance-label=<html><span style="font-size:12; font-weight:bold">Wygl\u0105d aplikacji</span><br>Wybierz przycisk po lewej lub z menu "Program | Ustawienia | Ustawienia programu" aby dostosowa\u0107 wygl\u0105d aplikacji.<br>W oknie ustawie\u0144, przejd\u017A do zak\u0142adki "Wygl\u0105d" i wybierz sw\u00F3j styl "Look And Feel".<hr>W oknie ustawie\u0144, mo\u017Cesz r\u00F3wnie\u017C wybra\u0107 wizualizacj\u0119 procesu oczekiwania. Moj\u0105 ulubion\u0105 jest "Dziwny tancerz".
WelcomeViewPanel-settings-datatype-label=<html><span style="font-size:12; font-weight:bold">Format wy\u015Bwietlanych danych</span><br>Wybierz przycisk po lewej lub z menu "Program | Ustawienia | Ustawienia programu" aby zdefiniowa\u0107 format danych.<br>W oknie ustawie\u0144, przejd\u017A do zak\u0142adki "Format danych" i wprowad\u017A format daty, godziny i liczb dziesi\u0119tnych.
WelcomeViewPanel-drivers-label=<html><span style="font-size:12; font-weight:bold">Sterowniki baz danych JDBC</span><br>Wybierz przycisk po lewej lub z menu "Program | Konfiguracja sterownik\u00F3w JDBC" aby okre\u015Bli\u0107 lokalizacje sterownik\u00F3w.<br>W programie s\u0105 ju\u017C zdefiniowane podstawowe ustawienia sterownik\u00F3w JDBC. Aby by\u0142o mo\u017Cliwe po\u0142\u0105czenie z baz\u0105 danych, sterowniki musz\u0105 by\u0107 widoczny przez program. Sterownik\u00F3w musisz poszuka\u0107 na stronach producent\u00F3w poszczeg\u00F3lnych baz danych lub na stronach producent\u00F3w sterownik\u00F3w JDBC. Umie\u015B\u0107 je w katalogu "jdbc" programu ORBADA, wtedy b\u0119d\u0105 odszukane automatycznie.
WelcomeViewPanel-connection-schema-label=<html><span style="font-size:12; font-weight:bold">Schemat po\u0142\u0105czenia</span><br>Wybierz przycisk po lewej lub z menu "Program | Nowe po\u0142\u0105czenie" aby okre\u015Bli\u0107 parametry po\u0142\u0105czenia z baz\u0105 danych.<br>Schemat po\u0142\u0105czenia, jest zbiorem parametr\u00F3w definiuj\u0105cych po\u0142\u0105czenie z baz\u0105 danych. W definicji schematu okre\u015Bli\u0107 mo\u017Cesz adres komputera na kt\u00F3rym pracuje baza danych, port komunikacji, nazw\u0119 bazy danych, nazw\u0119 u\u017Cytkownika oraz has\u0142o.<br>Schemat\u00F3w mo\u017Ce by\u0107 wiele, dla wielu baz danych.
WelcomeViewPanel-after-connection-label=<html><span style="font-size:12; font-weight:bold">Po nawi\u0105zaniu po\u0142\u0105czenia z baz\u0105 danych</span><br>Po nawi\u0105zaniu po\u0142\u0105czenia z baz\u0105 danych, automatycznie otwarta zostanie perspektywa po\u0142\u0105czenia oraz domy\u015Blne widoki, np. "Zapytania SQL".<br>Przy pomocy widok\u00F3w mo\u017Cesz przegl\u0105da\u0107 obiekty bazy danych, tabele, procedury, itp.<hr>W widoku "Zapytania SQL" mo\u017Cesz wykonywa\u0107 polecenia SQL. Wpisz polecenie, a nast\u0119pnie naci\u015Bnij Ctrl+Enter, polecenie zostanie wykonane. Polece\u0144 w tym widoku mo\u017Ce by\u0107 wiele, ka\u017Cde z nich musisz rozdzieli\u0107 przynajmniej jednym pustym wierszem.
WelcomeViewPanel-more-views-label=<html><span style="font-size:12; font-weight:bold">Wi\u0119cej widok\u00F3w</span><br>Po nawi\u0105zaniu po\u0142\u0105czenia, otworz\u0105 si\u0119 domy\u015Blne widoki. Jest ich wi\u0119cej! Z menu "Widok" mo\u017Cesz wybra\u0107 kolejne, b\u0119d\u0105 one zapami\u0119tane i po ponownym nawi\u0105zaniu po\u0142\u0105czenia z baz\u0105 danych otworz\u0105 si\u0119 automatycznie.
WelcomeViewPanel-welcome-label=<html><span style="font-size:14; font-weight:bold">Witaj w programie ORBADA</span><br>Najprawdopodobniej b\u0119dziesz potrzebowa\u0142 kilku rad by przygotowa\u0107 program do pracy.<br>Wszystkie znajduj\u0105 si\u0119 poni\u017Cej, przeczytaj je uwa\u017Cnie, a gwarantuj\u0119, \u017Ce polubisz prac\u0119 z programem ORBADA.<br><b>Je\u015Bli masz jaki\u015B problem z konfiguracj\u0105 programu lub sterownik\u00F3w, po\u0142\u0105czeniem do bazy danych, nie wiesz jak si\u0119 pos\u0142ugiwa\u0107 programem - pytaj, wejd\u017A na sf.net i utw\u00F3rz pro\u015Bb\u0119 o wsparcie. B\u0119d\u0119 wdzi\u0119czny za ka\u017Cdy kontakt.</b>
WelcomeViewPanel-tab-welcome-text=Witam w programie ORBADA
WelcomeViewPanel-settings-proxy-label=<html><span style="font-size:12; font-weight:bold">Ustawienia Proxy</span><br>Wybierz przycisk po lewej lub z menu "Program | Ustawienia | Ustawienia programu" by okre\u015Bli\u0107 w\u0142a\u015Bciwo\u015Bci po\u0142\u0105czenia za po\u015Brednictwem Proxy.
